Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the absolute value of n.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(n)、そこでnはnの値の絶対値です。

source: Complexity: O(1) if the collection conforms to RandomAccessCollection; otherwise, O(n), where n is the length of the collection.
ja: 計算量：O(1)、もしコレクションがRandomAccessCollectionに準拠するならば；そうでなければ、O(n)、そこでnはコレクションの長さです。

source: Complexity: O(1) on average, over many calls to append(_:) on the same collection.
ja: 計算量：同じコレクション上でのappend(_:)への多くの呼び出しに対して、均してO(1)。

source: Complexity: O(1), except if the sequence also conforms to Collection.
ja: 計算量：O(1)、例外としてシーケンスが同様にCollectionに準拠する場合を除きます。

source: Complexity: O(1), with O(k) deferred to each iteration of the result, where k is the number of elements to drop from the beginning of the sequence.
ja: 計算量：O(1)、結果の各反復に対してO(k)延期されて、ここでkはシーケンスの冒頭から除かれる要素の数です。

source: Complexity: O(1).
ja: 計算量：O(1)。

source: Complexity: O(k), where k is the length of the result.
ja: 計算量：O(k)、ここでkは結果の長さです。

source: Complexity: O(k), where k is the number of elements to drop from the beginning of the sequence.
ja: 計算量：O(k)、ここでkはシーケンスの冒頭から除かれる要素の数です。

source: Complexity: O(k), where k is the specified number of elements.
ja: 計算量：O(k)、ここでkは指定された要素の数です。

source: Complexity: O(m + n), where m is the length of this sequence and n is the length of the result.
ja: 計算量：O(m + n)、ここでmはこのシーケンスの長さで、nは結果の長さです。

source: Complexity: O(m + n), where n is the length of this sequence and m is the length of the result.
ja: 計算量：O(m + n)、ここでnはこのシーケンスの長さで、mは結果の長さです。

source: Complexity: O(m), where m is the combined length of the string and newElements.
ja: 計算量：O(m)、ここでmは文字列とnewElementsを合わせた長さです。

source: Complexity: O(m), where m is the combined length of the view and newElements.
ja: 計算量：O(m)、ここでmはビューとnewElementsを合わせた長さです。

source: Complexity: O(m), where m is the length of newElements.
ja: 計算量：O(m)、ここでmはnewElementsの長さです。

source: Complexity: O(m), where m is the length of the right-hand-side argument.
ja: 計算量：O(m)、ここでmは右手側の引数の長さです。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of other.
ja: 計算量：O(m)、ここでmはシーケンスの長さとotherの長さのより短い方です。

source: Complexity: O(m), where m is the lesser of the length of the sequence and the length of possiblePrefix.
ja: 計算量：O(m)、ここでmはシーケスの長さとpossiblePrefixの長さのより短い方です。

source: Complexity: O(n + c), where n is self.count and c is the number of changes contained by the parameter.
ja: 計算量：O(n + c)、ここでnはself.countです、そしてcはパラメータによって含まれる変更の数です。

source: Complexity: O(n + m), where n is length of this collection and m is the length of newElements.
ja: 計算量：O(n + m)、ここでnは配列の長さです、そしてmはnewElementsの長さです。

source: Complexity: O(n log n), where n is the length of the collection.
ja: 計算量：O(n log n)、ここでnはコレクションの長さです。

source: Complexity: O(n log n), where n is the length of the sequence.
ja: 計算量：O(n log n)、ここでnはシーケンスの長さです。

source: Complexity: O(n)
ja: 計算量：O(n)

source: Complexity: O(n), where n is the absolute value of n.
ja: 計算量：O(n)、そこでnはnの値の絶対値です。

source: Complexity: O(n), where n is the capacity being reserved.
ja: 計算量：O(n)、ここでnは確保されている容量です。

source: Complexity: O(n), where n is the combined length of the string and newElements.
ja: 計算量：O(n)、ここでnは文字列とnewElementsを合わせた長さです。

source: Complexity: O(n), where n is the length of substring.
ja: 計算量：O(n)、ここでnはsubstringの長さです。

source: Complexity: O(n), where n is the length of the collection.
ja: 計算量：O(n)、ここでnはコレクションの長さです。

source: Complexity: O(n), where n is the length of the resulting view.
ja: 計算量：O(n)、ここでnは結果となるビューの長さです。

source: Complexity: O(n), where n is the length of the sequence.
ja: 計算量：O(n)、ここでnはシーケンスの長さです。

source: Complexity: O(n), where n is the length of the string.
ja: 計算量：O(n)、ここでnは文字列の長さです。

source: Complexity: O(n), where n is the number of elements in the collection.
ja: 計算量：O(n)、ここでnはコレクションの中の要素数です。

source: Complexity: O(n), where n is the resulting distance.
ja: 計算量：O(n)、ここでnは結果となる隔たりです。

source: Complexity: O(N), where N is the length of the resulting String’s UTF-16.
ja: 計算量：O(N)、ここでNは結果となるStringの持つUTF-16の長さです。

source: Complexity: O(n) if non-contiguous, O(1) if already contiguous
ja: 計算量：O(n)、もし非隣接ならば、O(1)、もしすでに隣接ならば。

source: Complexity: Worst case performance is O(n * m), where n is the count of this collection and m is other.count.
ja: 計算量：最悪の場合の性能は、O(n * m)です、ここでnはこのコレクションの総数です、そしてmはother.countです。

source: Computational operations are defined on the SIMD protocol, which refines this protocol, and on the concrete types that conform to SIMD.
ja: 計算関係演算は、SIMDプロトコル上で、それはこのプロトコルを洗練させたものです、そしてSIMDに準拠する具象型上で、定義されます。

source: Configure the Sample Code Project
ja: 見本コードプロジェクトを構成設定する

source: Conforming Types
ja: これらの型が準拠

source: Conforming to the Strideable Protocol
ja: Strideableプロトコルに準拠する

source: Conforming to the TextOutputStream Protocol
ja: TextOutputStreamプロトコルに準拠する

source: Conforming to the TextOutputStreamable Protocol
ja: TextOutputStreamableプロトコルに準拠する

source: Conforms To
ja: 次に準拠

source: Conforms when Base conforms to AccelerateBuffer.
ja: BaseがAccelerateBufferに準拠する場合に準拠します。

source: Conforms when Base conforms to AccelerateMutableBuffer and MutableCollection.
ja: BaseがAccelerateMutableBufferとMutableCollectionに準拠する時に準拠します。

source: Conforms when Base conforms to BidirectionalCollection.
ja: BaseがBidirectionalCollectionに準拠する時に準拠します。

source: Conforms when Base conforms to ContiguousBytes.
ja: BaseがContiguousBytesに準拠する時に準拠します。

source: Conforms when Base conforms to DataProtocol.
ja: BaseがDataProtocolに準拠する時に準拠します。

source: Conforms when Base conforms to LazySequenceProtocol.
ja: BaseがLazySequenceProtocolに準拠する時に準拠します。

source: Conforms when Base conforms to MutableCollection.
ja: BaseがMutableCollectionに準拠する時に準拠します。

source: Conforms when Base conforms to RangeReplaceableCollection.
ja: BaseがRangeReplaceableCollectionに準拠する時に準拠します。

source: Conforms when Element is UInt8.
ja: ElementがUInt8である場合に準拠します。

source: Consider using detached tasks only when strictly necessary and impossible to model operations otherwise.
ja: 分離されたタスクの使用は、厳密に必要なそしてそれ以外では演算を形作るのが不可能な場合にのみ考慮してください。

source: Construct a YieldingContinuation with a specific Element type.
ja: 与えられたElement型をバッファするAsyncStreamを組み立てます。

source: Construct a YieldingContinuation with specific types including a failure.
ja: YieldingContinuationを特定の型それらで、ある失敗を含めて組み立てます。

source: Construct a YieldingContinuation.
ja: YieldingContinuationを組み立てます。

source: Construct with value v.value.
ja: 値v.valueを使って組み立てます。

source: Constructs an instance that can be used to begin parsing CodeUnits at any Unicode scalar boundary.
ja: あるインスタンスを組み立てます、それはCodeUnitの構文解析を何らかのユニコードスカラー境界で開始するのに使用できます。

source: Contains a buffer object, and provides access to an instance of Header and contiguous storage for an arbitrary number of Element instances stored in that buffer.
ja: バッファオブジェクトを収容します、そしてHeaderのインスタンスへのアクセスおよびそのバッファに格納される随意の数のElementインスタンスの隣接保管を提供します。

source: Contiguous strings also benefit from fast-paths and better optimizations.
ja: 隣接文字列はまた、高速パスそしてより良い最適化から利益を得ます。

source: Contiguous strings always operate in O(1) time for withUTF8 and always give a result for String.UTF8View.withContiguousStorageIfAvailable.
ja: 隣接文字列は常に O(1) 時間で withUTF8 に対して作動します、そして常に String.UTF8View.withContiguousStorageIfAvailable に対して結果を与えます。

source: Continuation bytes take the form 0b10xxxxxx.
ja: 継続バイトは、形式0b10xxxxxxを取ります。

source: Continuations
ja: さまざまな継続

source: Convert Completion Handlers to Use Asynchronous Methods
ja: 完了ハンドラを変換して非同期メソッドを使うようにする

source: Convert your pointer to an UnsafeMutableRawPointer instance and then use the raw pointer’s load(fromByteOffset:as:) and storeBytes(of:toByteOffset:as:) methods to read and write values.
ja: あなたのポインタをUnsafeMutableRawPointerインスタンスに変換して、それから生のポインタのもつload(fromByteOffset:as:)とstoreBytes(of:toByteOffset:as:)メソッドを使って値を読み書きしてください。

source: Convert your pointer to an UnsafeRawPointer instance and then use the raw pointer’s load(fromByteOffset:as:) method to read values.
ja: あなたのポインタをUnsafeRawPointerインスタンスに変換して、それから生のポインタのもつload(fromByteOffset:as:)メソッドを使って値を読みだしてください。

source: Converting Numeric Values
ja: 数値を変換する

source: Converting Other Types to Strings
ja: 他の型を文字列に変換する

source: Converting a C String
ja: C文字列を変換する

source: Converting a Substring to a String
ja: SubstringをStringに変換する

source: Converts a scalar from another encoding’s representation, returning nil if the scalar can’t be represented in this encoding.
ja: あるスカラーを別の符号化のもつ表現から変換します、nilを返します、もしそのスカラーがこの符号化で表現されることができないならば。

source: Converts from encoded to encoding-independent representation
ja: 符号化から符号化独立の表現へと変換します。

source: Converts from encoding-independent to encoded representation, returning nil if the scalar can’t be represented in this encoding.
ja: 符号化独立から符号化表現へと変換します、nilを返します、もしそのスカラーがこの符号化で表現されることができないならば。

source: Copies from a collection of UInt8 into this buffer’s memory.
ja: UInt8からなるコレクションからこのバッファのメモリにコピーします。

source: Copies the bytes from the given buffer to this buffer’s memory.
ja: 与えられたバッファからバイトをこのバッファの持つメモリにコピーします。

source: Copies the specified number of bytes from the given raw pointer’s memory into this pointer’s memory.
ja: 与えられた生のポインタの持つメモリからこのポインタの持つメモリに指定されたバイト数をコピーします。

source: Copying a value of type UnsafeBufferPointer does not copy the instances stored in the underlying memory.
ja: 型UnsafeBufferPointerの値をコピーすることは、基礎をなすメモリをコピーしません。

source: Copying a value of type UnsafeMutableBufferPointer does not copy the instances stored in the underlying memory.
ja: 型UnsafeMutableBufferPointerの値をコピーすることは、基礎をなすメモリをコピーしません。

source: Copying a variable or constant of type UnsafeRawBufferPointer does not copy the underlying memory.
ja: 型UnsafeRawBufferPointerの変数や定数をコピーすることは、基礎をなすメモリをコピーしません。

source: Copying a variable or constant of type UnsafeMutableRawBufferPointer does not copy the underlying memory.
ja: 型UnsafeMutableRawBufferPointerの変数や定数をコピーすることは、基礎をなすメモリをコピーしません。

source: Copying bytes directly from nontrivial, in-memory values does not produce valid copies and can only be done by calling a C API, such as memmove().
ja: 自明でない、メモリ中の値から直接にバイトをコピーすることは、有効なコピーを生成しません、そしてmemmove()のようなC APIを呼び出すことでのみ可能です。

source: Copying memory that contains values of nontrivial types can only be done safely with a typed pointer.
ja: 自明でない型の値を含むメモリをコピーすることは、型付ポインタでのみ安全になされることが可能です。

source: Create a collection of all the values in a range by using the half-open (..<) and closed (...) range operators.
ja: ある範囲の中のすべての値からなる１つのコレクションを半開（..<）および完結（...）範囲演算子を使って作成します。

source: Create a slice of the absences array that holds the second half of the days.
ja: 学期後半の日付を保持する、absences配列のスライスを作成してください。

source: Create a stride that steps over values between two boundaries using the stride(from:to:by:) and stride(from:through:by:) functions.
ja: ２つの境界の間の値をまたぐストライドをstride(from:to:by:)およびstride(from:through:by:)関数を使って作成します。

source: Creates a String having the given content.
ja: 与えられた内容を持っているあるStringを作成します。

source: Creates a Substring having the given content.
ja: 与えられた内容を持っているSubstringを作成します。

source: Creates a Unicode scalar with the specified numeric value.
ja: 指定された数値を使ってユニコードスカラーを作成します。

source: Creates a Unicode scalar with the specified value.
ja: 指定された値を使ってユニコードスカラーを作成します。

source: Creates a buffer over the same memory as the given buffer slice.
ja: 指定されたバッファスライスと同じメモリのすべてを覆うバッファを作成します。

source: Creates a buffer over the specified number of contiguous bytes starting at the given pointer.
ja: 指定された数の隣接バイトすべてを覆うバッファを、与えられたポインタで開始して作成します。

source: Creates a collection containing the specified number of the given element.
ja: 指定された数の与えられた要素を含んでいるコレクションを作成します。

source: Creates a duplicate of the given Unicode scalar.
ja: 与えられたユニコードスカラーの複製を作成します。

source: Creates a mutable typed buffer pointer referencing the same memory as the given immutable buffer pointer.
ja: 可変の型付バッファポインタを作成します、与えられた不変バッファポインタと同じメモリを参照しています。

source: Creates a mutable typed pointer referencing the same memory as the given immutable pointer.
ja: 可変の型付ポインタを作成します、与えられた不変ポインタと同じメモリを参照しています。

source: Creates a new buffer over the same memory as the given buffer.
ja: 指定されたバッファと同じメモリのすべてを覆う新しいバッファを作成します。

source: Creates a new buffer pointer over the specified number of contiguous instances beginning at the given pointer.
ja: 指定されたポインタで始まっている指定された数の隣接インスタンスすべてを覆う新しいバッファポインタを作成します。

source: Creates a new canonical combining class with the given raw integer value.
ja: 新しい正準結合クラスをこの与えられた生の整数値で作成します。

source: Creates a new collection by concatenating the elements of a collection and a sequence.
ja: あるコレクションとあるシーケンスの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection by concatenating the elements of a sequence and a collection.
ja: あるシーケンスとあるコレクションの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection by concatenating the elements of two collections.
ja: ２つのコレクションの要素を連結することによって新しいコレクションを作成します。

source: Creates a new collection containing the specified number of a single, repeated value.
ja: 指定された数の、ある単一の値の繰り返しを含んでいる新しいコレクションを作成します。

source: Creates a new index at the specified UTF-16 code unit offset
ja: 新しいインデックスをこの指定されたUTFー16コード単位オフセットで作成します。

source: Creates a new index at the specified code unit offset.
ja: 新しいインデックスをこの指定されたコード単位オフセットで作成します。

source: Creates a new instance by decoding from the given decoder, when the type’s RawValue is UInt8.
ja: 新しいインスタンスをこの与えられたデコーダからデコードすることによって作成します、型のもつRawValueがUInt8である場合。

source: Creates a new instance by decoding from the given decoder.
ja: 与えられたデコーダからデコードすることで新しいインスタンスを作成します。

source: Creates a new instance from an interpolated string literal.
ja: 新しいインスタンスを補間文字列リテラルから作成します。

source: Creates a new instance from the bit pattern of the given instance by truncating or sign-extending if needed to fit this type.
ja: もしこの型に適合するのに必要ならば切り詰めるか符号拡張によって、指定インスタンスのビットパターンから新しいインスタンスを作成します。

source: Creates a new instance from the given integer, if it can be represented exactly.
ja: 与えられた整数から新しいインスタンスを作成します、もしそれが正確に表現できるならば。

source: Creates a new instance from the given integer.
ja: 与えられた整数から新しいインスタンスを作成します。

source: Creates a new instance of a collection containing the elements of a sequence.
ja: あるシーケンスの要素を含んでいるあるコレクションの新しいインスタンスを作成します。

source: Creates a new instance of the system’s default random number generator.
ja: システムの持つ省略時の無作為数生成子の新しいインスタンスを作成します。

source: Creates a new instance with the representable value that’s closest to the given integer.
ja: 与えられた整数に最も近い表現可能な値を使って新しいインスタンスを作成します。

source: Creates a new instance with the same memory representation as the given value.
ja: 与えられた値と同じメモリ表現で新しいインスタンスを作成します。

source: Creates a new instance with the specified raw value.
ja: 指定された生の値を持つ新しいインスタンスを作成します。

source: Creates a new integer value from the given string and radix.
ja: 与えられた文字列と基数から新しい整数値を作成します。

source: Creates a new integer value from the given string.
ja: 与えられた文字列から新しい整数値を作成します。

source: Creates a new mutable buffer over the same memory as the given buffer.
ja: 与えられたバッファと同じメモリを覆う新しい可変バッファを作成します。

source: Creates a new mutable raw pointer from the given immutable raw pointer.
ja: 新しい可変の生のポインタを与えられた不変の生のポインタから作成します。

source: Creates a new pointer from the given address, specified as a bit pattern.
ja: 新しいポインタをこの与えられたアドレスから作成します、ビットパターンとして指定されます。

source: Creates a new pointer from the given pointer.
ja: 新しいボインタをこの与えられたポインタから作成します。

source: Creates a new raw pointer from an AutoreleasingUnsafeMutablePointer instance.
ja: 新しい生のポインタをAutoreleasingUnsafeMutablePointerインスタンスから作成します。

source: Creates a new raw pointer from the given mutable raw pointer.
ja: 新しい生のポインタを与えられた可変の生のポインタから作成します。

source: Creates a new raw pointer from the given typed pointer.
ja: 新しい生のポインタを与えられた型付ポインタから作成します。

source: Creates a new string by copying and validating the null-terminated UTF-8 data referenced by the given pointer.
ja: 新しい文字列を、与えられたポインタによって参照されるヌル終端のUTF-8データをコピーして検証することによって作成します。

source: Creates a new string by copying the null-terminated UTF-8 data referenced by the given pointer.
ja: 新しい文字列を、与えられたポインタによって参照されるヌル終端のUTF-8データをコピーすることによって作成します。

source: Creates a new string by copying the null-terminated data referenced by the given pointer using the specified encoding.
ja: 新しい文字列を、与えられたポインタによって参照されるヌル終端のデータをコピーすることによって作成します、指定された符号化を使います。

source: Creates a new string containing the characters in the given sequence.
ja: 与えられたシーケンスの中のそれら文字を含んでいるある新しい文字を作成します。

source: Creates a new string from the given substring.
ja: 新しい文字列を与えられた下位文字列から作成します。

source: Creates a new string representing the given string repeated the specified number of times.
ja: 指定された回数繰り返された与えられた文字列を表している新しい文字列を作成します。

source: Creates a new string with the specified capacity in UTF-8 code units, and then calls the given closure with a buffer covering the string’s uninitialized memory.
ja: 新しい文字列をUTF-8コード単位でのこの指定された収納能力で作成します、それから与えられたクロージャを、文字列のもつ初期化されないメモリを扱うバッファで呼び出します。

source: Creates a new typed pointer from the given opaque pointer.
ja: 与えられた不透明ポインタから新しい型付ポインタを作成します。

source: Creates a new value equal to zero.
ja: ゼロに等しい新しい値を作成します。

source: Creates a new value with the bit pattern of the given pointer.
ja: 与えられたポインタのビットパターンで新しい値を作成します。

source: Creates a new vector by decoding scalars from the given decoder.
ja: ある新しいベクターをこの与えられたデコーダからスカラーをデコードすることによって作成します。

source: Creates a new, empty collection.
ja: 新しい、空のコレクションを作成します。

source: Creates a raw buffer over the contiguous bytes in the given typed buffer.
ja: 指定された型付バッファの中の隣接バイトすべてを覆う生のバッファを作成します。

source: Creates a raw buffer over the same memory as the given raw buffer slice, with the indices rebased to zero.
ja: 与えられた生のバッファスライスと同じメモリのすべてを覆う生のバッファを作成します、ゼロに再配置されたインデックスを持ちます。

source: Creates a sequence of pairs built out of two underlying sequences.
ja: ２つの根底にあるシーケンスから組み立てられるペアからなるシーケンスを作成します。

source: Creates a string by interpreting the file path’s content as UTF-8.
ja: ファイルパスのもつ内容をUTF-8として解釈することによってある文字列を作成します。

source: Creates a string containing the given character.
ja: 与えられた文字を含んでいる文字列を作成します。

source: Creates a string corresponding to the given collection of Unicode scalars.
ja: 指定されたユニコードスカラーのコレクションに対応する文字列を組み立てます。

source: Creates a string corresponding to the given sequence of UTF-16 code units.
ja: 指定されたUTF-16コード単位の連続に対応する文字列を作成します。

source: Creates a string corresponding to the given sequence of UTF-8 code units.
ja: 指定されたUTF-8コード単位の連続に対応する文字列を作成します。

source: Creates a string from a file path, validating its UTF-8 contents.
ja: ファイルパスからある文字列を作成します、それのUTF-8内容を検証します。

source: Creates a string from another string wrapped in a data value.
ja: ある文字列をデータ値の中にラップされる別の文字列から作成します。

source: Creates a string from the given Unicode code units in the specified encoding.
ja: 与えられたユニコード単位から指定されたエンコーディングで文字列を作成する。

source: Creates a string from the null-terminated sequence of bytes at the given pointer.
ja: 与えられたポインタでのnull終端のバイトシーケンスから文字列を作成します。

source: Creates a string from the null-terminated, UTF-8 encoded sequence of bytes at the given pointer.
ja: 与えられたポインタでの、null終端の、UTF-8エンコードされたバイトシーケンスから文字列を作成します。

source: Creates a string representing the given character repeated the specified number of times.
ja: 指定された回数繰り返された与えられた文字を表している文字列を作成します。

source: Creates a string representing the given value in base 10, or some other specified base.
ja: 与えられた値を底10、または何か他の指定の底で表している文字列を作成します。

source: Creates a string representing the given value.
ja: 与えられた値を表している文字列を作成します。

source: Creates a string with a detailed representation of the given value, suitable for debugging.
ja: 与えられた値の詳細な表現での文字列を作成します、デバッグに適するもの。

source: Creates a vector from the given sequence.
ja: あるベクターをこの与えられたシーケンスから作成します。

source: Creates a vector from the specified elements.
ja: あるベクターをこの指定された要素それらから作成します。

source: Creates a vector with zero in all lanes.
ja: あるベクターを全レーンにおいてゼロで作成します

source: Creates a view into the given collection that allows access to elements within the specified range.
ja: 与えられたコレクションに関するあるビューを作成します、それは指定された範囲の内の要素にアクセスを与えます。

source: Creates an asynchronous sequence that concatenates the results of calling the given error-throwing transformation with each element of this sequence.
ja: ある非同期シーケンスを作成します、それは与えられたエラースロー変換をこのシーケンスの各要素で呼び出すことの結果を連結します。

source: Creates an asynchronous sequence that concatenates the results of calling the given transformation with each element of this sequence.
ja: ある非同期シーケンスを作成します、それは与えられた変換をこのシーケンスの各要素で呼び出すことの結果を連結します。

source: Creates an asynchronous sequence that contains, in order, the elements of the base sequence that satisfy the given predicate.
ja: ある非同期シーケンスを作成します、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられた述部を満たすものです。

source: Creates an asynchronous sequence that maps an error-throwing closure over the base sequence’s elements, omitting results that don’t return a value.
ja: ある非同期シーケンスを作成します、それはあるエラースロークロージャを基底シーケンスのもつ要素のすべてにわたってマップします、値を返さない結果を省きます。

source: Creates an asynchronous sequence that maps the given closure over the asynchronous sequence’s elements, omitting results that don’t return a value.
ja: ある非同期シーケンスを作成します、それは与えられたクロージャを非同期シーケンスのもつ要素のすべてにわたってマップします、値を返さない結果を省きます。

source: Creates an asynchronous sequence that maps the given closure over the asynchronous sequence’s elements.
ja: ある非同期シーケンスを作成します、それは与えられたクロージャを非同期シーケンスのもつ要素のすべてにわたってマップします。

source: Creates an asynchronous sequence that maps the given error-throwing closure over the asynchronous sequence’s elements.
ja: ある非同期シーケンスを作成します、それは与えられたエラースロークロージャを非同期シーケンスのもつ要素のすべてにわたってマップします。

source: Creates an empty instance ready to be filled with string literal content.
ja: 文字列リテラル内容で満たされる準備ができている空のインスタンスを作成します。

source: Creates an empty static string.
ja: 空の静的文字列を作成します。

source: Creates an empty string.
ja: 空の文字列を作成します。

source: Creates an empty substring.
ja: 空の下位文字列を作成します。

source: Creates an empty view instance.
ja: 空のビューインスタンスを作成します。

source: Creates an immutable typed buffer pointer referencing the same memory as the given mutable buffer pointer.
ja: 不変の型付バッファポインタを作成します、与えられた可変バッファポインタと同じメモリを参照しています。

source: Creates an immutable typed pointer referencing the same memory as the given mutable pointer.
ja: 不変の型付ポインタを作成します、与えられた可変ポインタと同じメモリを参照しています。

source: Creates an index in the given UTF-16 view that corresponds exactly to the specified string position.
ja: 与えられたUTF-16ビューの中のあるインデックスを作成します、それは指定された文字列位置に正確に対応します。

source: Creates an index in the given UTF-8 view that corresponds exactly to the specified UTF16View position.
ja: 与えられたUTF-8ビューの中のあるインデックスを作成します、それは指定されたUTF16View位置に正確に対応します。

source: Creates an index in the given Unicode scalars view that corresponds exactly to the specified UTF16View position.
ja: 与えられたユニコードスカラービューの中のあるインデックスを作成します、それは指定されたUTF16View位置に正確に対応します。

source: Creates an index in the given string that corresponds exactly to the specified position.
ja: 与えられた文字列の中のあるインデックスを作成します、それは指定された位置に正確に対応します。

source: Creates an instance from the description of a given LosslessStringConvertible instance.
ja: 与えられたLosslessStringConvertibleインスタンスの叙述からインスタンスを作成します。

source: Creates an instance initialized to a single Unicode scalar.
ja: ある単一のユニコードスカラーへと初期化されるインスタンスを作成します。

source: Creates an instance initialized to a single character that is made up of one or more Unicode scalar values.
ja: ひとつ以上のユニコードスカラー値でできているある単一の文字へと初期化されるインスタンスを作成します。

source: Creates an instance initialized to the given string value.
ja: 与えられた文字列値へ初期化されるインスタンスを作成します。

source: Creates an instance initialized to the given value.
ja: 与えられた値に初期化されるインスタンスを作成します。

source: Creates an instance initialized to the specified integer value.
ja: 指定された整数値に初期化されるインスタンスを作成します。

source: Creates an instance initialized to the value of a string literal.
ja: ある文字列リテラルの値へと初期化されるインスタンスを作成します。

source: Creates an instance of the UTF-16 codec.
ja: UTF-16コーデックのインスタンスを作成します。

source: Creates an instance of the UTF-32 codec.
ja: UTF-32コーデックのインスタンスを作成します。

source: Creates an instance of the UTF-8 codec.
ja: UTF-8コーデックのインスタンスを作成します。
